app/services/reminder_service.rb

  def self.send_reminders
    # Fetch tasks with upcoming reminders
    byebug
    tasks_with_reminders = Task.where("due_date <= ?", Time.now + 1.hour)
    tasks_with_reminders.each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE (due_date <= '2024-02-29 13:32:02.217998')