app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 5], ["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @tasks = current_user.tasks.page(params[:page])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 1], ["LIMIT", 1]]
---
  def show
    @task = current_user.tasks.find(params[:id])

INSERT INTO "tasks" ("title", "description", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "rmahendra78@gmail.com"], ["description", "123456"], ["status", "pending"], ["user_id", 5], ["created_at", "2024-02-29 12:18:28.013598"], ["updated_at", "2024-02-29 12:18:28.013598"]]
---
  def create
    @task = current_user.tasks.new(task_params)
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", "completed"], ["updated_at", "2024-02-29 11:46:39.135407"], ["id", 2]]
---
  def update
    @task = current_user.tasks.find(params[:id])
    if @task.update(task_params)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
---
  def destroy
    @task = current_user.tasks.find(params[:id])
    @task.destroy